// 27. Определить количество цифр в числе

Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());


Console.Write($"количество цифр в числе: {a.Length} ");