// 15. Дано число. Проверить кратно ли оно 7 и 23

    Console.Write("Введите число: ");
    int a = Convert.ToInt32(Console.ReadLine());

if (a%7==0 & a%23==0) Console.WriteLine("Число кратное 7 и 23");
else {

 Console.WriteLine("Число некратное 7 и 23");
}
